In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('gapminder.csv')

type(df)

pandas.core.frame.DataFrame

In [4]:
df.shape

(1704, 6)

In [5]:
df['country']

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [6]:
type(df['country']) 
#if you would hv put double brackets like df[['country']]
#then thts a DataFrame and not a Series

pandas.core.series.Series

In [7]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [9]:
df.head(5)

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [12]:
df.iloc[:5]
#.iloc[] is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [16]:
df.tail(5)

       country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [18]:
pd.DataFrame([['Portocosta',1952,8425333,'Asia',28.801,779.445314]])

            0     1        2     3       4           5
0  Portocosta  1952  8425333  Asia  28.801  779.445314

In [19]:
pd.DataFrame([['Portocosta',1952,8425333,'Asia',28.801,779.445314]],
            columns = ['country','year','population','consistency','life_exp','GDP_cap'])

      country  year  population consistency  life_exp     GDP_cap
0  Portocosta  1952     8425333        Asia    28.801  779.445314

In [27]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2],
  'passings': [3, 7, 12]
}
#if u try to add col with same name then last col wins as exp in a dict
myvar = pd.DataFrame(mydataset)
myvar

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford        12

In [28]:
df.columns

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

In [30]:
df.keys() #as df works as a specialize dict

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

In [37]:
df[['country','life_exp']].head(3)

       country  life_exp
0  Afghanistan    28.801
1  Afghanistan    30.332
2  Afghanistan    31.997

In [44]:
df['country'].unique() #just like np.unique(df['country'])

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [46]:
df['country'].nunique() #no. unique

142

In [47]:
df['country'].value_counts()

Afghanistan          12
Pakistan             12
New Zealand          12
Nicaragua            12
Niger                12
                     ..
Eritrea              12
Equatorial Guinea    12
El Salvador          12
Egypt                12
Zimbabwe             12
Name: country, Length: 142, dtype: int64

In [55]:
#just renaming cols --> they wont be updated in real df
#unless u mention inplace=True
df.rename({'population':'Population', 'country':'Country'}, axis=1).head(3)

       Country  year  Population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710

In [51]:

df.rename({'population':'Population', 'country':'Country'}, axis=1, inplace=True)

In [56]:
df.rename({'continent':'Continent'}).head(3)
#this wont work..why?
#because default axis=0 so bad luck!
#df.drop('continent') so even this wont work

       Country  year  Population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710

In [59]:
df.drop('continent', axis=1).head(2)
#dont worry its not permanent as inplace=False

       Country  year  Population  life_exp     gdp_cap
0  Afghanistan  1952     8425333    28.801  779.445314
1  Afghanistan  1957     9240934    30.332  820.853030

In [62]:
df['year+7'] = df['year'] + 7
df.head(3)

       Country  year  Population continent  life_exp     gdp_cap  year+7
0  Afghanistan  1952     8425333      Asia    28.801  779.445314    1959
1  Afghanistan  1957     9240934      Asia    30.332  820.853030    1964
2  Afghanistan  1962    10267083      Asia    31.997  853.100710    1969

In [66]:
df['GDP'] = df['Population']*df['gdp_cap']
df.tail(3)

,Country,year,Population,continent,life_exp,gdp_cap,year+7,GDP
1701,Zimbabwe,1997,11404948,Africa,46.809,792.449960,2004,9.037851e+09
1702,Zimbabwe,2002,11926563,Africa,39.989,672.038623,2009,8.015111e+09
1703,Zimbabwe,2007,12311143,Africa,43.487,469.709298,2014,5.782658e+09

In [71]:
df['sr.no'] = range(len(df)) 
#len(df)=1704...if u give low value like 100 or something it would throw error because all rows would not be filled
df.head(3)

,Country,year,Population,continent,life_exp,gdp_cap,year+7,GDP,sr.no
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,6.567086e+09,0
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,7.585449e+09,1
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,8.758856e+09,2

In [74]:
series = df['Country']
series

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: Country, Length: 1704, dtype: object

In [78]:
series[1234:1240]

1234      Poland
1235      Poland
1236    Portugal
1237    Portugal
1238    Portugal
1239    Portugal
Name: Country, dtype: object

In [82]:
#df[0] indexing row like this wont work
#because if pandas would hv allowed even this then
#there would be confusion along axis
#but hey, slicing works

df[5:9]

,Country,year,Population,continent,life_exp,gdp_cap,year+7,GDP,sr.no
5,Afghanistan,1977,14880372,Asia,38.438,786.113360,1984,1.169766e+10,5
6,Afghanistan,1982,12881816,Asia,39.854,978.011439,1989,1.259856e+10,6
7,Afghanistan,1987,13867957,Asia,40.822,852.395945,1994,1.182099e+10,7
8,Afghanistan,1992,16317921,Asia,41.674,649.341395,1999,1.059590e+10,8

In [83]:
df.index

RangeIndex(start=0, stop=1704, step=1)

In [84]:
df.index.values

array([   0,    1,    2, ..., 1701, 1702, 1703], dtype=int64)

In [87]:
df.index = range(1,df.shape[0]+1)
df.index.values #for non-tech noobs

array([   1,    2,    3, ..., 1702, 1703, 1704], dtype=int64)

In [88]:
#Explicit indicies -> wht u see
#Implicit indicies -> 0,1,2,3 which python sees

In [90]:
sample_df = df.head(3)
sample_df

,Country,year,Population,continent,life_exp,gdp_cap,year+7,GDP,sr.no
1,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,6.567086e+09,0
2,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,7.585449e+09,1
3,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,8.758856e+09,2

In [97]:
sample_df.index = ['a','b','c'] #u can provide duplicate vals like ['a','a','a'] it still works!
sample_df

,Country,year,Population,continent,life_exp,gdp_cap,year+7,GDP,sr.no
a,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,6.567086e+09,0
b,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,7.585449e+09,1
c,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,8.758856e+09,2

In [101]:
sample_df.reset_index() #drop=Ture inside index would just remove tht index col

,index,Country,year,Population,continent,life_exp,gdp_cap,year+7,GDP,sr.no
0,a,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,6.567086e+09,0
1,b,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,7.585449e+09,1
2,c,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,8.758856e+09,2

In [107]:
df.columns
#let's change the name of 'sr.no' to 'year' which already exist
#YES this IS possible...n when u'll try to access year
#both the cols will show up...this is helpful for classification sometimes
#say all d rows belonging to a certain year...

Index(['Country', 'year', 'Population', 'continent', 'life_exp', 'gdp_cap',
       'year+7', 'GDP', 'sr.no'],
      dtype='object')

In [109]:
df.columns = ['Country', 'year', 'Population', 'continent', 'life_exp', 'gdp_cap', 'year+7', 'GDP', 'year']
df.columns

Index(['Country', 'year', 'Population', 'continent', 'life_exp', 'gdp_cap',
       'year+7', 'GDP', 'year'],
      dtype='object')

In [115]:
df['year']

      year  year
1     1952     0
2     1957     1
3     1962     2
4     1967     3
5     1972     4
...    ...   ...
1700  1987  1699
1701  1992  1700
1702  1997  1701
1703  2002  1702
1704  2007  1703

[1704 rows x 2 columns]